# Pandas: DataFrame and Series

In [17]:
import pandas as pd

x = {"Name": ['Rose','John', 'Jane', 'Mary'], "ID": [1,2,3,4], "Department": ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], "Salary": [100000, 80000, 50000, 60000]}

# creating the dictionary to a DataFrame
df = pd.DataFrame(x)

# display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [12]:
# retrieving "ID" column and assigning it to a variable
x = df[["ID"]]
x

   ID
0   1
1   2
2   3
3   4

In [14]:
type(x)

pandas.core.frame.DataFrame

In [16]:
# Access to multicolumn
z = df[["Department", "Salary", "ID"]]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [18]:
data = {
    "Student": ["David","Samuel", "Terry","Evan"],
    "Age":[27,24,22,32],
    "Country":["UK", "Canada", "China", "USA"], 
    "Course":["Python","Data Structures","Machine Learning","Web Development"],
    "Marks":[85,72,89,76]}

dfStudent = pd.DataFrame(data)

dfStudent

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [26]:
print(dfStudent.iloc[0,0])
print(dfStudent.iloc[0,2])
print(dfStudent.iloc[2,0])

David
UK
Terry

In [29]:
print(dfStudent.loc[0,"Marks"])

85

In [33]:
df = dfStudent
df = df.set_index("Student")
df

         Age Country            Course  Marks
Student
David     27      UK            Python     85
Samuel    24  Canada   Data Structures     72
Terry     22   China  Machine Learning     89
Evan      32     USA   Web Development     76

In [34]:
df.head()

         Age Country            Course  Marks
Student
David     27      UK            Python     85
Samuel    24  Canada   Data Structures     72
Terry     22   China  Machine Learning     89
Evan      32     USA   Web Development     76

In [37]:
df.iloc[0:2]

         Age Country           Course  Marks
Student
David     27      UK           Python     85
Samuel    24  Canada  Data Structures     72

In [48]:
dfStudent.loc[1:3]
dfStudent

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [47]:
dfStudent.iloc[1:3]
dfStudent

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

8.0